paulusTecnion/uberlogger-stm32/Core/Src/main.c
	if (htim == &htim3 )
	  {


		if (busy)
		{
			Error_Handler();
		}
		busy = 1;


		 // Check which version of the timer triggered this callback and toggle LED
		// Should be RTC_FORMAT_BCD, but there's a bug in the HAL_RTC_Gettime function
		HAL_RTC_GetTime(&hrtc, &current_time, RTC_FORMAT_BIN);
		HAL_RTC_GetDate(&hrtc, &current_date, RTC_FORMAT_BIN);


		current_date_time.year = current_date.Year;
		current_date_time.month = current_date.Month;
		current_date_time.date = current_date.Date;
		current_date_time.hours = current_time.Hours;
		current_date_time.minutes = current_time.Minutes;
		current_date_time.seconds = current_time.Seconds;
		// Next line not 100% correct!
		current_date_time.subseconds = 1000 * (current_time.SecondFraction - current_time.SubSeconds) / (current_time.SecondFraction + 1);

		// Are still in the first ADC half?
		if (!gpio_is_half)
		{
			// 0x50000411 = GPIOB, 2nd byte (GPIOB8 to GPIOB15)
//			spi_msg_1_ptr->gpioData[gpio_result_write_ptr] = (GPIOB->IDR >> 8);
			spi_msg_slow_freq_1->gpioData[gpio_result_write_ptr] = (GPIOB->IDR >> 8);
//			memcpy((void*)&spi_msg_1_ptr->timeData[gpio_result_write_ptr], &current_date_time, sizeof(s_date_time_t));
			memcpy((void*)&spi_msg_slow_freq_1->timeData[gpio_result_write_ptr], &current_date_time, sizeof(s_date_time_t));
//			spi_msg_1_ptr->dataLen = gpio_result_write_ptr +1 ;
			spi_msg_slow_freq_1->dataLen = gpio_result_write_ptr +1 ;
		} else { // If not, we fill the second part
//			spi_msg_2_ptr->gpioData[gpio_result_write_ptr] = (GPIOB->IDR >> 8);
			spi_msg_slow_freq_2->gpioData[gpio_result_write_ptr] = (GPIOB->IDR >> 8);
//			memcpy((void*)&spi_msg_2_ptr->timeData[gpio_result_write_ptr], &current_date_time, sizeof(s_date_time_t));
			memcpy((void*)&spi_msg_slow_freq_2->timeData[gpio_result_write_ptr], &current_date_time, sizeof(s_date_time_t));
//			spi_msg_2_ptr->dataLen = gpio_result_write_ptr+1;
			spi_msg_slow_freq_2->dataLen = gpio_result_write_ptr +1 ;
		}
//


		// In case we are doing 16 bits, we manually need to copy data from the IIR filter buffer to the adc
		if (adc_resolution == ADC_16_BITS)
		{
			if (!adc_16b_is_half)
			{
				memcpy((uint8_t*)spi_msg_slow_freq_1->adcData + 2*8*gpio_result_write_ptr, iirFilter, 8*2);
			} else {
				memcpy((uint8_t*)spi_msg_slow_freq_2->adcData + 2*8*gpio_result_write_ptr, iirFilter, 8*2);
			}
		} else {
			if (!adc_is_half)
			{
        // in 12 bit mode we copy from the buffer "iirFilter", but the actual IIR filter is not used in 12 bits mode. 
//				memcpy((uint8_t*)spi_msg_1_ptr->adcData + 2*8*gpio_result_write_ptr, iirFilter, 8*2);
				memcpy((uint8_t*)spi_msg_slow_freq_1->adcData + 2*8*gpio_result_write_ptr, iirFilter, 8*2);
			} else {
//				memcpy((uint8_t*)spi_msg_2_ptr->adcData + 2*8*gpio_result_write_ptr, iirFilter, 8*2);
				memcpy((uint8_t*)spi_msg_slow_freq_2->adcData + 2*8*gpio_result_write_ptr, iirFilter, 8*2);
			}
		}


		tim3_counter++;
		gpio_result_write_ptr++;


		if (gpio_result_write_ptr >= spi_lines_per_transaction)
		{
			gpio_is_half = !gpio_is_half;
			gpio_ready = 1;

			// when in 16 bit mode, manually set adc_ready flag
			if (adc_resolution == ADC_16_BITS)
			{
				adc_16b_is_half = ~adc_16b_is_half;
				// adc_ready = 1;
			} else {
				adc_is_half = ~adc_is_half;
		  }
		  adc_ready = 1;
		}

		gpio_result_write_ptr = gpio_result_write_ptr % spi_lines_per_transaction;
		// if gpio_result_write_ptr is back to 0, we need to manually set the adc_16b_is_half byte

	  }
}



void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc)
{

		if (adc_resolution == ADC_12_BITS)
		{
//			for (int i = 0; i < ADC_VALUES_PER_SPI_TRANSACTION; i++)
//			{
//				spi_msg_1_ptr->adcData_u16[i] = adc_comp_12b(&(spi_msg_1_ptr->adcData_u16[i]));
//			}

			for (int i = 0; i<8; i++)
			{
				//  correct adc values for non-linearities
				iirFilter[i] = adc_comp(active_lut_table[i], &(adc12Buffer[i]));
			}

		} else {
			for (int i = 0; i<8; i++)
			{
				// First correct adc values for non-linearities
				correctedAdc = adc_comp(active_lut_table[i],&(adc16bBuffer[i]));
				// Then filter
				iir_filter(&correctedAdc, &(iirFilter[i]), i);
			}
		}

}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
{
		
		if (adc_resolution == ADC_12_BITS)
		{
//			for (int i = 0; i < ADC_VALUES_PER_SPI_TRANSACTION; i++)
//			{
//				spi_msg_2_ptr->adcData_u16[i] = adc_comp_12b(&(spi_msg_2_ptr->adcData_u16[i]));
//			}

			for (int i = 0; i<8; i++)
			{
				// First correct adc values for non-linearities
				iirFilter[i] = adc_comp(active_lut_table[i], &(adc12Buffer[i+8*4]));
			}
		
		} else {
			for (int i = 0; i<8; i++)
			{
				// First correct adc values for non-linearities
				correctedAdc = adc_comp(active_lut_table[i], &(adc16bBuffer[i+8]));
				// Then filter
				iir_filter(&correctedAdc, &(iirFilter[i]), i);
			}
		}

}

void HAL_ADC_ErrorCallback(ADC_HandleTypeDef *hadc)
{

}

void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == STM_ADC_EN_Pin)
	{
			logging_en = 1;
	}
}

void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == STM_ADC_EN_Pin)
	{
		//HAL_SPI_DMAStop(&hspi1);

		logging_en = 0;

	}
}

void Adc_start()
{
	if (adc_resolution == ADC_12_BITS)
	{
		HAL_ADC_Start_DMA(
		&hadc1,
		(uint32_t*)(adc12Buffer),
		8*8);
	} else {
		HAL_ADC_Start_DMA(
		&hadc1,
		(uint32_t*)(adc16bBuffer),
		16);
	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
//  PWR->CR1 |= PWR_CR1_DBP; // disable write protect
//  RCC->BDCR |= 0x18; // Max drive strenght for LSE
//  PWR->CR1 &= ~PWR_CR1_DBP; // enable write protect
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_ADC1_Init();
  MX_TIM3_Init();
  MX_RTC_Init();
  MX_TIM14_Init();
  MX_TIM16_Init();
  /* USER CODE BEGIN 2 */


  // Set MISO pin drive strenght to High speed (bit 8 and 9 = '10' (bit 9 = 1))
  GPIOB->OSPEEDR |= (0x0200);
  adc_data_u16 = (uint16_t*)spi_msg_slow_freq_1->adcData;

  // Enable TIM1 interrupt
//  TIM1->DIER |= TIM_DIER_UIE;
//  NVIC_EnableIRQ(TIM1_BRK_UP_TRG_COM_IRQn);


//  prev_date_time.subseconds = 9999;
  // Backup current adc settings
  hadc1_bak = hadc1;



  iir_init();


  HAL_TIM_Base_Start(&htim14);
  HAL_TIM_Base_Start(&htim16);


  // Turn off the interrupt flag for timer 14.
  CLEAR_BIT(TIM14->DIER, TIM_DIER_UIE);
  CLEAR_BIT(TIM16->DIER, TIM_DIER_UIE);

  memset(spi_msg_slow_freq_1->adcData, 0, sizeof(spi_msg_slow_freq_1->adcData));
  memset(spi_msg_slow_freq_2->adcData, 0, sizeof(spi_msg_slow_freq_2->adcData));

